acceptance/perf/artillery/dogfood-post-uncontended.yml
# M46d's Artillery counterpart to ../tflw/dogfood-post-uncontended.tflw and
# ../k6/dogfood-post-uncontended.js — static body, no capture, per-user cart row (uncontended).
# Same open-model/shared-token-cache caveats as checkout-burst.yml — see that file's own comment.
config:
  target: "http://localhost:4001/v1"
  # 600/s found by bisection — the flat rate whose achieved p95 (~32ms) landed in the same
  # ballpark as tflw/k6's closed-model p95 (~30-31ms) on a cold/first run, at roughly a third of
  # their achieved throughput (~1820/s). On repeated back-to-back runs this rate proved unstable —
  # one run saw a 54% request failure rate (ECONNRESET / client-side fetch failures against the
  # shared token-refresh call in processor.cjs), something neither k6 nor tflw ever exhibited
  # anywhere in this arc. See checkout-burst.yml's own comment + acceptance/README.md's M46d
  # section for the full write-up.
  phases:
    - duration: 20
      arrivalRate: 600
      name: "flat"
  plugins:
    metrics-by-endpoint: {}
  processor: "./processor.cjs"

scenarios:
  - name: "M46d dogfood POST-uncontended"
    flow:
      - function: "ensureToken"
      - post:
          url: "/cart/items"
          name: "cart-add"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            productId: "6c0b2198-a3c4-4fe0-8aae-64a6714fff3c"
            quantity: 1
          expect:
            - statusCode: 201